[
    {
        "id": 0,
        "image": "/resources/warbrigade/warbrigade-mission.png",
        "name": "WarBrigade",
        "description": [
            "Ce jeu a été réalisé dans le cadre du projet de synthèse à la fin de ma technique au Cégep de Sainte-Foy en programmation web, mobile et jeux vidéo. Il a été développé avec Unity sur une période de deux mois avec trois autres collègues de classe. L'objectif est d'accomplir une série de missions. Pour ce projet, ma contribution s'est concentrée sur l'interface utilisateur, tant lorsque le joueur est en jeu que lorsqu'il navigue dans les menus.",
            "This game was created as part of the final project for my program at Cégep de Sainte-Foy in web, mobile, and video game programming. It was developed using Unity over a two-month period with three other classmates. The objective is to complete a series of missions. For this project, my contribution focused on the user interface, both when the player is in the game and when navigating the menus."
        ],
        "hyperlink": "https://krahab.itch.io/warbrigade"
    },
    {
        "id": 1,
        "image": "/resources/blingland/blingLand.png",
        "name": "Bling Land",
        "description": [
            "Avec trois autres collègues rencontrés au cégep, nous avons décidé d'expérimenter avec Godot pour découvrir ce programme. Pour ce faire, nous avons créé Bling Land. Dans ce jeu, fortement inspiré de Kingdom Two Crowns, le joueur doit fortifier son royaume, recruter des villageois et le défendre contre des envahisseurs. Dans ce projet, j'ai principalement contribué aux menus.",
            "With three other colleagues I met at college, we decided to experiment with Godot to explore this program. To do so, we created Bling Land. In this game, heavily inspired by Kingdom Two Crowns, the player must fortify their kingdom, recruit villagers, and defend it against invaders. In this project, I primarily contributed to the menus."
        ],
        "hyperlink": "https://krahab.itch.io/blingland"
    }
]